## Terraform Summary

| Step                         | Result  |
|:-----------------------------|:-------:|
| 🖌  Terraform Format & Style | ✅ |
| ⚙️  Terraform Initialization  | ✅ |
| 🤖  Terraform Validation     | ✅ |
| 📖  Terraform Plan           | ✅ |

_**Hint:** If "Terraform Format & Style" failed, run `terraform fmt -recursive` from the `terraform/` directory and commit the results._

### Output

<details>
<summary>Validation Output</summary>

```
Success! The configuration is valid.


```

</details>

<details>
<summary>Plan Output</summary>

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
  ~ update in-place
-   destroy
-/+ destroy and then create replacement
+/- create replacement and then destroy

Terraform will perform the following actions:

  # aws_ecs_service.console will be updated in-place
  ~ resource "aws_ecs_service" "console" {
        id                                 = "arn:aws:ecs:us-west-2:357150818708:service/cpfreporter/cpfreporter-console"
        name                               = "cpfreporter-console"
        tags                               = {}
      ~ task_definition                    = "arn:aws:ecs:us-west-2:357150818708:task-definition/cpfreporter-console:123" -> (known after apply)
        # (15 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # aws_ecs_task_definition.console must be replaced
+/- resource "aws_ecs_task_definition" "console" {
      ~ arn                      = "arn:aws:ecs:us-west-2:357150818708:task-definition/cpfreporter-console:123" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:us-west-2:357150818708:task-definition/cpfreporter-console" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [
              ~ {
                  ~ image                  = "ghcr.io/usdigitalresponse/cpf-reporter-console@sha256:2ad82617b0cb3278cadce642a6eb623c9025bfeaee84db0d17a10322be479dfc" -> "ghcr.io/usdigitalresponse/cpf-reporter-console@sha256:571ba6e1b57ced9dea2e62025b68f80df9a28ae9da1360f0b574d500f40186c1"
-                   mountPoints            = []
                    name                   = "console"
-                   portMappings           = []
-                   systemControls         = []
-                   volumesFrom            = []
                    # (7 unchanged attributes hidden)
                },
            ] # forces replacement
        )
      ~ id                       = "cpfreporter-console" -> (known after apply)
      ~ revision                 = 123 -> (known after apply)
-       tags                     = {} -> null
        # (10 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_s3_object.lambda_artifact-graphql will be updated in-place
  ~ resource "aws_s3_object" "lambda_artifact-graphql" {
      ~ etag                   = "aa58d7f2c1123b3ad7048bce2dd4c377-6" -> "9aec4e89c018919741d557f4baa1d761"
        id                     = "graphql.9aec4e89c018919741d557f4baa1d761.zip"
        tags                   = {}
      ~ version_id             = "g4Bmtvo.h7p8PvRXXyaxbfdCt4fggM4D" -> (known after apply)
        # (12 unchanged attributes hidden)
    }

  # aws_s3_object.lambda_artifact-processValidationJson will be updated in-place
  ~ resource "aws_s3_object" "lambda_artifact-processValidationJson" {
      ~ etag                   = "ada4a30aba929324eb23ead6dd3883bf-5" -> "49f6291dc84bb27b95f10c7de8148425"
        id                     = "processValidationJson.49f6291dc84bb27b95f10c7de8148425.zip"
        tags                   = {}
      ~ version_id             = "zNuENS1ak5DREMCaRLSqKZN.k68WoBBM" -> (known after apply)
        # (12 unchanged attributes hidden)
    }

  # aws_s3_object.lambda_artifact-python must be replaced
-/+ resource "aws_s3_object" "lambda_artifact-python" {
+       acl                    = (known after apply)
      ~ arn                    = "arn:aws:s3:::cpfreporter-lambdaartifacts-357150818708-us-west-2/python.d27a7024ab73d12ec39bd0c1e32c7eeb.zip" -> (known after apply)
      ~ bucket_key_enabled     = false -> (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "61028e9a1765f5ab0cd218be32182e94-4" -> "7448bcae460e1de8b8ff5b084f35121a"
      ~ id                     = "python.d27a7024ab73d12ec39bd0c1e32c7eeb.zip" -> (known after apply)
      ~ key                    = "python.d27a7024ab73d12ec39bd0c1e32c7eeb.zip" -> "python.7448bcae460e1de8b8ff5b084f35121a.zip" # forces replacement
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
      ~ source_hash            = "d27a7024ab73d12ec39bd0c1e32c7eeb" -> "7448bcae460e1de8b8ff5b084f35121a"
      ~ storage_class          = "STANDARD" -> (known after apply)
-       tags                   = {} -> null
      ~ version_id             = "ss8smnk075qa2d2ufi8VIqWwgAImAygp" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["200.html"] will be updated in-place
  ~ resource "aws_s3_object" "origin_dist_artifact" {
      ~ etag                   = "2f098c5ffc07c3d29b0e768b5c80f1c2" -> "d2be778e41c7709a91b1a4d93e2ff19f"
        id                     = "dist/200.html"
      ~ source_hash            = "2f098c5ffc07c3d29b0e768b5c80f1c2" -> "d2be778e41c7709a91b1a4d93e2ff19f"
        tags                   = {}
      ~ version_id             = "m0Z_.lDctQfPHcLy2yc2nFN.Y6kssYih" -> (known after apply)
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["build-manifest.json"] will be updated in-place
  ~ resource "aws_s3_object" "origin_dist_artifact" {
      ~ etag                   = "f04604bb8bd0314da9389a22a5d73394" -> "6db90bfb1a352bb86ee5fbfca83e1f18"
        id                     = "dist/build-manifest.json"
      ~ source_hash            = "f04604bb8bd0314da9389a22a5d73394" -> "6db90bfb1a352bb86ee5fbfca83e1f18"
        tags                   = {}
      ~ version_id             = "_IOppVzTj__uuOJKGD24sNXqOA4yrPVy" -> (known after apply)
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["chunk-references.json"] will be updated in-place
  ~ resource "aws_s3_object" "origin_dist_artifact" {
      ~ etag                   = "b4b1f5d7c08b8fc0680b7cd8e7a98daf" -> "5cb73770b0e64e3281a1477ced1019ac"
        id                     = "dist/chunk-references.json"
      ~ source_hash            = "b4b1f5d7c08b8fc0680b7cd8e7a98daf" -> "5cb73770b0e64e3281a1477ced1019ac"
        tags                   = {}
      ~ version_id             = "kwIulmD0A9o..MgWvbBG_6uS0X6BI8vf" -> (known after apply)
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["index.html"] will be updated in-place
  ~ resource "aws_s3_object" "origin_dist_artifact" {
      ~ etag                   = "2f098c5ffc07c3d29b0e768b5c80f1c2" -> "d2be778e41c7709a91b1a4d93e2ff19f"
        id                     = "dist/index.html"
      ~ source_hash            = "2f098c5ffc07c3d29b0e768b5c80f1c2" -> "d2be778e41c7709a91b1a4d93e2ff19f"
        tags                   = {}
      ~ version_id             = "NSPgGXFy2lLeN9HIMHGWZQwmbz1AbZF." -> (known after apply)
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["static/js/app.7045cab2.js"] will be destroyed
  # (because key ["static/js/app.7045cab2.js"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       arn                    = "arn:aws:s3:::cpfreporter-origin-357150818708-us-west-2/dist/static/js/app.7045cab2.js" -> null
-       bucket                 = "cpfreporter-origin-357150818708-us-west-2" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "text/javascript" -> null
-       etag                   = "b9af6b129430d6376c1905d8d1d8c261" -> null
-       force_destroy          = false -> null
-       id                     = "dist/static/js/app.7045cab2.js" -> null
-       key                    = "dist/static/js/app.7045cab2.js" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/app.7045cab2.js" -> null
-       source_hash            = "b9af6b129430d6376c1905d8d1d8c261" -> null
-       storage_class          = "STANDARD" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "cpf-reporter"
-           "service"    = "cpf-reporter"
-           "usage"      = "workload"
        } -> null
-       version_id             = "zLNsgazG0FPA91jbB3S09k6EOBjV_IRp" -> null
    }

  # aws_s3_object.origin_dist_artifact["static/js/app.7045cab2.js.LICENSE.txt"] will be destroyed
  # (because key ["static/js/app.7045cab2.js.LICENSE.txt"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       arn                    = "arn:aws:s3:::cpfreporter-origin-357150818708-us-west-2/dist/static/js/app.7045cab2.js.LICENSE.txt" -> null
-       bucket                 = "cpfreporter-origin-357150818708-us-west-2" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "text/plain" -> null
-       etag                   = "3b6b61b80017ed2a756a2cec1364fac3" -> null
-       force_destroy          = false -> null
-       id                     = "dist/static/js/app.7045cab2.js.LICENSE.txt" -> null
-       key                    = "dist/static/js/app.7045cab2.js.LICENSE.txt" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/app.7045cab2.js.LICENSE.txt" -> null
-       source_hash            = "3b6b61b80017ed2a756a2cec1364fac3" -> null
-       storage_class          = "STANDARD" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "cpf-reporter"
-           "service"    = "cpf-reporter"
-           "usage"      = "workload"
        } -> null
-       version_id             = "VsdNq873LfWaDlkVckpO1gjVxa3ZOBFd" -> null
    }

  # aws_s3_object.origin_dist_artifact["static/js/app.7185f465.js"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = (known after apply)
+       arn                    = (known after apply)
+       bucket                 = "cpfreporter-origin-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "text/javascript"
+       etag                   = "1d8b72d5cbcee32765bd4cfb13768ddb"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/static/js/app.7185f465.js"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/app.7185f465.js"
+       source_hash            = "1d8b72d5cbcee32765bd4cfb13768ddb"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "cpf-reporter"
+           "service"    = "cpf-reporter"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # aws_s3_object.origin_dist_artifact["static/js/app.7185f465.js.LICENSE.txt"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = (known after apply)
+       arn                    = (known after apply)
+       bucket                 = "cpfreporter-origin-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "text/plain"
+       etag                   = "3b6b61b80017ed2a756a2cec1364fac3"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/static/js/app.7185f465.js.LICENSE.txt"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/app.7185f465.js.LICENSE.txt"
+       source_hash            = "3b6b61b80017ed2a756a2cec1364fac3"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "cpf-reporter"
+           "service"    = "cpf-reporter"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # module.lambda_function-cpfValidation.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "cpfreporter-cpfValidation"
      ~ last_modified                  = "2024-04-30T22:11:20.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:cpfreporter-cpfValidation:90" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:cpfreporter-cpfValidation:90/invocations" -> (known after apply)
      ~ s3_key                         = "python.d27a7024ab73d12ec39bd0c1e32c7eeb.zip" -> "python.7448bcae460e1de8b8ff5b084f35121a.zip"
        tags                           = {}
      ~ version                        = "90" -> (known after apply)
        # (19 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_COMMIT_SHA"                = "50dbbd902cfd1f3b5e185c3be3d9c33056563872" -> "2593464bb2965ff9e291befe2679e150ed1168ab"
              ~ "DD_TAGS"                      = "git.commit.sha:50dbbd902cfd1f3b5e185c3be3d9c33056563872,git.repository_url:github.com/usdigitalresponse/cpf-reporter" -> "git.commit.sha:2593464bb2965ff9e291befe2679e150ed1168ab,git.repository_url:github.com/usdigitalresponse/cpf-reporter"
              ~ "DD_VERSION"                   = "50dbbd902cfd1f3b5e185c3be3d9c33056563872" -> "2593464bb2965ff9e291befe2679e150ed1168ab"
                # (14 unchanged elements hidden)
            }
        }

        # (4 unchanged blocks hidden)
    }

  # module.lambda_function-cpfValidation.aws_lambda_permission.current_version_triggers["S3BucketNotification"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "S3BucketNotification" -> (known after apply)
      ~ qualifier           = "90" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.lambda_function-graphql.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "cpfreporter-graphql"
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:cpfreporter-graphql:138" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:cpfreporter-graphql:138/invocations" -> (known after apply)
        tags                           = {}
      ~ version                        = "138" -> (known after apply)
        # (21 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_COMMIT_SHA"                      = "50dbbd902cfd1f3b5e185c3be3d9c33056563872" -> "2593464bb2965ff9e291befe2679e150ed1168ab"
              ~ "DD_TAGS"                            = "git.commit.sha:50dbbd902cfd1f3b5e185c3be3d9c33056563872,git.repository_url:github.com/usdigitalresponse/cpf-reporter" -> "git.commit.sha:2593464bb2965ff9e291befe2679e150ed1168ab,git.repository_url:github.com/usdigitalresponse/cpf-reporter"
              ~ "DD_VERSION"                         = "50dbbd902cfd1f3b5e185c3be3d9c33056563872" -> "2593464bb2965ff9e291befe2679e150ed1168ab"
                # (18 unchanged elements hidden)
            }
        }

        # (5 unchanged blocks hidden)
    }

  # module.lambda_function-graphql.aws_lambda_permission.current_version_triggers["APIGateway"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "APIGateway" -> (known after apply)
      ~ qualifier           = "138" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.lambda_function-processValidationJson.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "cpfreporter-processValidationJson"
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:cpfreporter-processValidationJson:46" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:cpfreporter-processValidationJson:46/invocations" -> (known after apply)
        tags                           = {}
      ~ version                        = "46" -> (known after apply)
        # (21 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_COMMIT_SHA"                      = "50dbbd902cfd1f3b5e185c3be3d9c33056563872" -> "2593464bb2965ff9e291befe2679e150ed1168ab"
              ~ "DD_TAGS"                            = "git.commit.sha:50dbbd902cfd1f3b5e185c3be3d9c33056563872,git.repository_url:github.com/usdigitalresponse/cpf-reporter" -> "git.commit.sha:2593464bb2965ff9e291befe2679e150ed1168ab,git.repository_url:github.com/usdigitalresponse/cpf-reporter"
              ~ "DD_VERSION"                         = "50dbbd902cfd1f3b5e185c3be3d9c33056563872" -> "2593464bb2965ff9e291befe2679e150ed1168ab"
                # (16 unchanged elements hidden)
            }
        }

        # (5 unchanged blocks hidden)
    }

  # module.lambda_function-processValidationJson.aws_lambda_permission.current_version_triggers["S3BucketNotification"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "S3BucketNotification" -> (known after apply)
      ~ qualifier           = "46" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

Plan: 7 to add, 10 to change, 7 to destroy.
```

</details>

*Pusher: @TylerHendrickson, Action: `pull_request_target`, Workflow: [`Continuous Integration`](https://github.com/usdigitalresponse/cpf-reporter/actions/runs/8912507587)*